Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.node01 will be created
+ resource "yandex_compute_instance" "node01" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node001.netology.cloud"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCg86r9ifFZP7awcLXq1RzWsu/YL9COKbWQK9Fiq6kt3JShL9FqGv1AzM3xJA4NTWD2Hwn5ujP82VZZ4ivliPvm0Qo+x4uKOn5633+Dx74tOt+3A2eR4rMY9cgyrQL/nRRyZTcdxkoAli+wy73RNd8TO39aGWMRo186myMbrEbwRQS9oLIwAE0cA28/qwYPBP62hAJG9ts6r32DzT9+yVfLn85r3NzsN2zcjhdxAez6/OwWn1uS9qhyBUWx9owTe5SHv/zYUrzSiiqjKUH7Q4L6iPkiVlS1jkBitlQGGwVp46SGhj7oei+ZmWCgq0em9NubeJacQQDo52IF0tYFQzxSGE1hkoVnRz7x3gIHAw8mzu1QV6X3LgufnJul7nTa16L2IPGOK7EZgaXSGzj8n+2ViQBKtdhne2K03cTv5XQzUz/e2jAaTXPf2J8A/TJh4aMo/LnNQjGHDE+PRie+tniKThbmUmH/lXgH3HNHO6Uyv0bSxhpHVTdu2yS8En5gGVE= vagrant@vagrant
            EOT
        }
      + name                      = "node01"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd83n3uou8m03iq9gavu"
              + name        = (known after apply)
              + size        = 20
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = "e9br0gkblpm24uqq5up4"
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 6
          + memory        = 6
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.node02 will be created
+ resource "yandex_compute_instance" "node02" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node002.netology.cloud"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCg86r9ifFZP7awcLXq1RzWsu/YL9COKbWQK9Fiq6kt3JShL9FqGv1AzM3xJA4NTWD2Hwn5ujP82VZZ4ivliPvm0Qo+x4uKOn5633+Dx74tOt+3A2eR4rMY9cgyrQL/nRRyZTcdxkoAli+wy73RNd8TO39aGWMRo186myMbrEbwRQS9oLIwAE0cA28/qwYPBP62hAJG9ts6r32DzT9+yVfLn85r3NzsN2zcjhdxAez6/OwWn1uS9qhyBUWx9owTe5SHv/zYUrzSiiqjKUH7Q4L6iPkiVlS1jkBitlQGGwVp46SGhj7oei+ZmWCgq0em9NubeJacQQDo52IF0tYFQzxSGE1hkoVnRz7x3gIHAw8mzu1QV6X3LgufnJul7nTa16L2IPGOK7EZgaXSGzj8n+2ViQBKtdhne2K03cTv5XQzUz/e2jAaTXPf2J8A/TJh4aMo/LnNQjGHDE+PRie+tniKThbmUmH/lXgH3HNHO6Uyv0bSxhpHVTdu2yS8En5gGVE= vagrant@vagrant
            EOT
        }
      + name                      = "node02"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd83n3uou8m03iq9gavu"
              + name        = (known after apply)
              + size        = 10
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = "e9br0gkblpm24uqq5up4"
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.node03 will be created
+ resource "yandex_compute_instance" "node03" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node003.netology.cloud"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCg86r9ifFZP7awcLXq1RzWsu/YL9COKbWQK9Fiq6kt3JShL9FqGv1AzM3xJA4NTWD2Hwn5ujP82VZZ4ivliPvm0Qo+x4uKOn5633+Dx74tOt+3A2eR4rMY9cgyrQL/nRRyZTcdxkoAli+wy73RNd8TO39aGWMRo186myMbrEbwRQS9oLIwAE0cA28/qwYPBP62hAJG9ts6r32DzT9+yVfLn85r3NzsN2zcjhdxAez6/OwWn1uS9qhyBUWx9owTe5SHv/zYUrzSiiqjKUH7Q4L6iPkiVlS1jkBitlQGGwVp46SGhj7oei+ZmWCgq0em9NubeJacQQDo52IF0tYFQzxSGE1hkoVnRz7x3gIHAw8mzu1QV6X3LgufnJul7nTa16L2IPGOK7EZgaXSGzj8n+2ViQBKtdhne2K03cTv5XQzUz/e2jAaTXPf2J8A/TJh4aMo/LnNQjGHDE+PRie+tniKThbmUmH/lXgH3HNHO6Uyv0bSxhpHVTdu2yS8En5gGVE= vagrant@vagrant
            EOT
        }
      + name                      = "node03"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd83n3uou8m03iq9gavu"
              + name        = (known after apply)
              + size        = 10
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = "e9br0gkblpm24uqq5up4"
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ internal_ip_address_node001_yandex_cloud = (known after apply)
+ internal_ip_address_node002_yandex_cloud = (known after apply)
+ internal_ip_address_node003_yandex_cloud = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://0a6d-217-197-228-106.eu.ngrok.io/lock?id=vk1391%252Fdiplom_devops_terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d . -- -var yandex_token=y0_AgAAAAApE-BQAATuwQAAAADahPMqgfnxVo1eRRiEbmApeU5UvVxSWpA -var yandex_cloudid=b1g8b46i03j5u870g8u6 -var=yandex_folder_id=b1gv8k8e82fm8o612hnl`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`